## Apply functions to Columns (Series) in a DataFrame

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'a': [10, 20, 30],
                  'b': [20, 30, 40]})

In [3]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [4]:
df.shape

(3, 2)

Calculate the mean or the average of each column, I just need to use the `.mean()` method.

In [5]:
df.mean()

a    20.0
b    30.0
dtype: float64

In [6]:
print( type(df.mean()) )

<class 'pandas.core.series.Series'>

In [7]:
print( df.mean().index )

Index(['a', 'b'], dtype='object')

What if I wanted to calculate the average of each row in `df`?

In [8]:
df.mean( axis=0 ) ### axis=0 corresponds to average per column

a    20.0
b    30.0
dtype: float64

To get the average per row we must set `axis=1`.

In [9]:
df.mean( axis=1 )

0    15.0
1    25.0
2    35.0
dtype: float64

Other methods exist, such as the standard deviation, `.std()`.

In [10]:
df.std(axis=0)

a    10.0
b    10.0
dtype: float64

What if we want to apply a function that's not available in Pandas?

We will use the `.apply()` method to apply any type of function to the DataFrame.

In [11]:
### define our own average function

def my_avg(x):
    return sum(x) / len(x)

In [12]:
%whos

Variable   Type         Data/Info
---------------------------------
df         DataFrame        a   b\n0  10  20\n1  20  30\n2  30  40
my_avg     function     <function my_avg at 0x0000023F8FFB83A0>
np         module       <module 'numpy' from 'C:\<...>ges\\numpy\\__init__.py'>
pd         module       <module 'pandas' from 'C:<...>es\\pandas\\__init__.py'>

In [13]:
### apply our function to every column in the data frame
### DO NOT INCLUDE THE ()
df.apply(my_avg, axis=0)

a    20.0
b    30.0
dtype: float64

In [14]:
### apply our function to every row in the data frame
df.apply(my_avg, axis=1)

0    15.0
1    25.0
2    35.0
dtype: float64

## Demonstrate Apply with real data

In [15]:
import seaborn as sns

In [16]:
titanic = sns.load_dataset('titanic')

In [17]:
%whos

Variable   Type         Data/Info
---------------------------------
df         DataFrame        a   b\n0  10  20\n1  20  30\n2  30  40
my_avg     function     <function my_avg at 0x0000023F8FFB83A0>
np         module       <module 'numpy' from 'C:\<...>ges\\numpy\\__init__.py'>
pd         module       <module 'pandas' from 'C:<...>es\\pandas\\__init__.py'>
sns        module       <module 'seaborn' from 'C<...>s\\seaborn\\__init__.py'>
titanic    DataFrame         survived  pclass    <...>\n[891 rows x 15 columns]

What's inside the `titanic` data set?

In [18]:
titanic.shape

(891, 15)

In [19]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [20]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [21]:
titanic.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

Let's take a look at `deck` to see what's going on.

In [22]:
titanic['deck']

0      NaN
1        C
2      NaN
3        C
4      NaN
      ...
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: deck, Length: 891, dtype: category
Categories (7, object): [A, B, C, D, E, F, G]

Go through and calculate the fraction of MISSING entries in `deck`.

In [23]:
pd.isnull(titanic['deck'])

0       True
1      False
2       True
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: deck, Length: 891, dtype: bool

In [24]:
titanic['deck'].isnull()

0       True
1      False
2       True
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: deck, Length: 891, dtype: bool

In [25]:
print( type( titanic['deck'].isnull() ) )

<class 'pandas.core.series.Series'>

In [27]:
titanic['deck'].isnull().value_counts()

True     688
False    203
Name: deck, dtype: int64

In [28]:
titanic['deck'].isnull().sum()

688

In [29]:
### the fraction of missings is the number of missings divided by the number of entries
titanic['deck'].isnull().sum() / titanic.shape[0]

0.7721661054994389

In [30]:
### fraction missing and non-missing
titanic['deck'].isnull().value_counts() / titanic.shape[0]

True     0.772166
False    0.227834
Name: deck, dtype: float64

Let's define a function that calculates the fraction missing.

In [31]:
def prop_missing(x):
    """proption (fraction) of missing values
    assume `x` is a Series object
    """
    return x.isnull().sum() / len(x)

Apply `prop_missing()` to every column in `titanic`.

In [32]:
titanic.apply(prop_missing, axis=0)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

## How many columns are missing per row?

In [33]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [34]:
titanic.iloc[0]

survived                 0
pclass                   3
sex                   male
age                     22
sibsp                    1
parch                    0
fare                  7.25
embarked                 S
class                Third
who                    man
adult_male            True
deck                   NaN
embark_town    Southampton
alive                   no
alone                False
Name: 0, dtype: object

Rather than working with the proportion or fraction, let's just count the number of missing entries.

In [35]:
print( type( titanic.iloc[0]) )

<class 'pandas.core.series.Series'>

In [36]:
def count_missing(x):
    """count the number of missing values
    assume x is a Series object
    """
    return x.isnull().sum()

In [37]:
titanic.apply(count_missing, axis=1)

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [38]:
print( len( titanic.apply(count_missing, axis=1) ) )

891

Let's find all rows with at least 1 missing value

In [39]:
titanic.apply(count_missing, axis=1) > 0

0       True
1      False
2       True
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Length: 891, dtype: bool

In [40]:
titanic.loc[ titanic.apply(count_missing, axis=1) > 0 ]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

What if we wanted all rows with ZERO missing values...

In [41]:
titanic.loc[ titanic.apply(count_missing, axis=1) == 0 ]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [42]:
titanic.loc[ titanic.apply(count_missing, axis=1) == 0 ].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 182 entries, 1 to 889
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     182 non-null    int64
 1   pclass       182 non-null    int64
 2   sex          182 non-null    object
 3   age          182 non-null    float64
 4   sibsp        182 non-null    int64
 5   parch        182 non-null    int64
 6   fare         182 non-null    float64
 7   embarked     182 non-null    object
 8   class        182 non-null    category
 9   who          182 non-null    object
 10  adult_male   182 non-null    bool
 11  deck         182 non-null    category
 12  embark_town  182 non-null    object
 13  alive        182 non-null    object
 14  alone        182 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 18.2+ KB

For the rows that have at least 1 missing, what's the proportion of missing per column?

First apply a row-wise operation, then apply a column-wise operation.

In [43]:
titanic.loc[ titanic.apply(count_missing, axis=1) > 0 ].apply(prop_missing, axis=0)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.249647
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002821
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.970381
embark_town    0.002821
alive          0.000000
alone          0.000000
dtype: float64

How many rows have 0 missing? 1 missing? 2 missing? etc...

In [44]:
titanic.apply(count_missing, axis=1).value_counts()

1    549
0    182
2    160
dtype: int64